Revit 2027 API
ExportLayerKey(String, String, SpecialType) Constructor
 Constructs a new ExportLayerKey with categoryName, subCategoryName and a special type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportLayerKey(
	string categoryName,
	string subCategoryName,
	SpecialType num
)
Public Sub New (
	categoryName As String,
	subCategoryName As String,
	num As SpecialType
)
public:
ExportLayerKey(
	String^ categoryName,
	String^ subCategoryName,
	SpecialType num
)
new :
        categoryName : string *
        subCategoryName : string *
        num : SpecialType -> ExportLayerKey
Parameters
categoryName String
 The category name for the layer key.
subCategoryName String
 The subCategoryName for the layer key.
num SpecialType
 The special type for layer key.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ExportLayerKey Class
ExportLayerKey Overload
Autodesk.Revit.DB Namespace